Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: If you want to simulate more complex API Gateway events in your tests, then manually do an HTTP POST to `http://localhost:8080/\_lambda_` (port 8081 in test mode) with the raw API Gateway json events. These events will be placed directly on the Quarkus Lambda poll loop for processing. Here's an example of that:
ja_jp: テストでより複雑な API Gateway イベントをシミュレートする場合は、生の API Gateway json イベントを使用して `http://localhost:8080/\_lambda_` (テストモードではポート 8081) に対して手動で HTTP POST を実行します。これらのイベントは、処理のために Quarkus Lambda ポーリングループに直接配置されます。その例を次に示します。

source: If you want to specify the URI explicitly, so it is always the same regardless of the value of `quarkus.http.root-path`, use an absolute path that begins with a forward slash.
ja_jp: URIを明示的に指定し、 `quarkus.http.root-path` の値にかかわらず常に同じになるようにしたい場合は、スラッシュで始まる絶対パスを使用します。

source: If you want to stream JSON objects in your response, you can use https://html.spec.whatwg.org/multipage/server-sent-events.html[Server-Sent Events] by just annotating your endpoint method with link:{jaxrsapi}/jakarta/ws/rs/Produces.html[`@Produces(MediaType.SERVER_SENT_EVENTS)`] and specifying that each element should be <<json,serialised to JSON>> with `@RestStreamElementType(MediaType.APPLICATION_JSON)`.
ja_jp: レスポンスにJSONオブジェクトをストリーミングしたい場合は、エンドポイントメソッドに link:{jaxrsapi}/jakarta/ws/rs/Produces.html[`@Produces(MediaType.SERVER_SENT_EVENTS)`] アノテーションを付けるだけで、link:https://html.spec.whatwg.org/multipage/server-sent-events.html[Server-Sent Events] を使用することができます。 そして各要素に `@RestStreamElementType(MediaType.APPLICATION_JSON)` を指定することで、<<json,serialised to JSON>> されます。

source: If you want to stream JSON objects in your response, you can use https://html.spec.whatwg.org/multipage/server-sent-events.html[Server-Sent Events] by just annotating your endpoint method with link:{jaxrsapi}/jakarta/ws/rs/Produces.html[`@Produces(MediaType.SERVER_SENT_EVENTS)`] and specifying that each element should be xref:json[serialised to JSON] with `@RestStreamElementType(MediaType.APPLICATION_JSON)`.
ja_jp: レスポンスにJSONオブジェクトをストリーミングしたい場合は、エンドポイントメソッドに link:{jaxrsapi}/jakarta/ws/rs/Produces.html[@Produces(MediaType.SERVER_SENT_EVENTS)] アノテーションを付けるだけで、 link:https://html.spec.whatwg.org/multipage/server-sent-events.html[Server-Sent Events] を使用することができます。 そして各要素に `@RestStreamElementType(MediaType.APPLICATION_JSON)` を指定することで、 xref:json[JSONにシリアライズ] されます。

source: If you want to stream JSON objects in your response, you can use https://html.spec.whatwg.org/multipage/server-sent-events.html[Server-Sent Events] by just annotating your endpoint method with link:{jaxrsapi}/javax/ws/rs/Produces.html[`@Produces(MediaType.SERVER_SENT_EVENTS)`] and specifying that each element should be <<json,serialised to JSON>> with `@RestSseElementType(MediaType.APPLICATION_JSON)`.
ja_jp: レスポンスで JSON オブジェクトをストリーミングしたい場合は、 link:https://html.spec.whatwg.org/multipage/server-sent-events.html[エンドポイントメソッド] にlink:{jaxrsapi}/javax/ws/rs/Produces.html[@Produces(MediaType.SERVER_SENT_EVENTS)] でアノテーションし、各要素が `@RestSseElementType(MediaType.APPLICATION_JSON)` で xref:json[JSON にシリアライズ] されるように指定します。

source: If you want to stream JSON objects in your response, you can use https://html.spec.whatwg.org/multipage/server-sent-events.html[Server-Sent Events] by just annotating your endpoint method with link:{jaxrsapi}/javax/ws/rs/Produces.html[`@Produces(MediaType.SERVER_SENT_EVENTS)`] and specifying that each element should be <<json,serialised to JSON>> with `@RestStreamElementType(MediaType.APPLICATION_JSON)`.
ja_jp: レスポンスで JSON オブジェクトをストリーミングする場合は、エンドポイントメソッドに link:{jaxrsapi}/javax/ws/rs/Produces.html[`@Produces(MediaType.SERVER_SENT_EVENTS)`] でアノテーションを付けるだけで、 https://html.spec.whatwg.org/multipage/server-sent-events.html[Server-Sent Events] を使用できます。そして指定した場合、 `@RestStreamElementType (MediaType.APPLICATION_JSON)` を使用し各要素は <<json,JSONにシリアライズ>> されるべきです。

source: If you want to stream your response element by element, you can make your endpoint method return a link:{mutinyapi}/io/smallrye/mutiny/Multi.html[`Multi`] type (from https://smallrye.io/smallrye-mutiny/[Mutiny]). This is especially useful for streaming text or binary data.
ja_jp: レスポンスを要素ごとにストリーミングする場合は、エンドポイントメソッドに (https://smallrye.io/smallrye-mutiny/[Mutiny] の) link:{mutinyapi}/io/smallrye/mutiny/Multi.html[`Multi`] 型を返すようにすることができます。これは、テキストまたはバイナリーデータのストリーミングに特に役立ちます。

source: If you want to test that an extension properly fails at build time, use the `setExpectedException` method:
ja_jp: エクステンションがビルド時に正しく失敗することをテストする場合は、 `setExpectedException` メソッドを使用します。

source: If you want to test the artifact produced by your build with Integration Tests, add the following plugin configuration. Test names `*IT` and annotated with `@QuarkusIntegrationTest` will be run against the artifact produced by the build (JAR file, container image, etc). See the xref:getting-started-testing.adoc#quarkus-integration-test[Integration Testing guide] for more info. + `maven.home` is only required if you have custom configuration in `${maven.home}/conf/settings.xml`.
ja_jp: ビルドによって生成されたアーティファクトを統合テストでテストする場合は、次のプラグイン設定を追加します。テスト名 `*IT` と `@QuarkusIntegrationTest` のアノテーションが付けられたテストは、ビルドによって生成されたアーティファクト (JAR ファイル、コンテナーイメージなど) に対して実行されます。詳細については、xref:getting-started-testing.adoc#quarkus-integration-test 統合テストガイドを参照してください。+ `maven.home` は、 `${maven.home}/conf/settings.xml` にカスタム設定がある場合にのみ必要です。

source: If you want to test your application immediately then set the `quarkus.openshift.route.expose` config property to `true` to <<exposing_routes,expose the service automatically>>, e.g. add `-Dquarkus.openshift.route.expose=true` to the command above.
ja_jp: アプリケーションをすぐにテストしたい場合は、 `quarkus.openshift.route.expose` 設定プロパティを `true` に設定して、 <<exposing_routes,サービスを自動的に公開>> します。例えば、上記のコマンドに `-Dquarkus.openshift.route.expose=true` を追加します。

source: If you want to test your application immediately then set the `quarkus.openshift.route.expose` config property to `true` to xref:exposing_routes[expose the service automatically], e.g. add `-Dquarkus.openshift.route.expose=true` to the command above.
ja_jp: もし、すぐにアプリケーションをテストしたい場合は、 `quarkus.openshift.route.expose` の設定プロパティに `true` を設定し、 xref:exposing_routes[自動的にサービスを公開] します。例: `-Dquarkus.openshift.route.expose=true` を上記コマンドに追加

source: If you want to test your application immediately, set the `quarkus.openshift.route.expose` configuration property to `true` to expose the service automatically.
ja_jp: アプリケーションをすぐにテストしたい場合は、 `quarkus.openshift.route.expose` 設定プロパティを `true` に設定し、自動的にサービスを公開します。

source: If you want to test your native executable with Integration Tests, add the following plugin configuration. Test names `*IT` and annotated `@NativeImageTest` will be run against the native executable. See the xref:building-native-image.adoc[Native executable guide] for more info.
ja_jp: ネイティブ実行可能ファイルをIntegration Testsでテストしたい場合は、以下のプラグイン設定を追加してください。テスト名 `*IT` とアノテーション `@NativeImageTest` は、ネイティブ実行可能ファイルに対して実行されます。詳しくは、 xref:building-native-image.adoc[ネイティブ実行可能ファイルガイド] をご覧ください。

source: If you want to try this example within the local Azure Functions environment, you can use this command
ja_jp: ローカルの Azure Functions 環境でこのサンプルを試したい場合は、次のコマンドを 使用できます。

source: If you want to try this example within the local Azure Functions environment, you can use this command:
ja_jp: ローカルの Azure Functions 環境でこのサンプルを試したい場合は、次のコマンドを使用できます。

source: If you want to try your app with a local Azure Functions environment, you can use this command
ja_jp: ローカルの Azure Functions 環境でアプリを試したい場合は、次のコマンドを使用できます。

source: If you want to try your app with a local Azure Functions environment, you can use this command:
ja_jp: ローカルの Azure Functions 環境でアプリケーションを試したい場合は、次のコマンドを使用できます。

source: If you want to use Dev Services then all you need to do is include the relevant extension for the type of database you want (either reactive or JDBC, or both), and don't configure a database URL, username and password, Quarkus will provide the database and you can just start coding without worrying about config.
ja_jp: DevServicesを使用する場合、必要なのは使用するデータベースの種類（リアクティブまたはJDBC、またはその両方）に応じた関連するエクステンションを含めることだけで、データベースのURLやユーザー名、パスワードを設定する必要はありません。Quarkusがデータベースを提供するので、ユーザーは設定に煩わされることなく、ただコーディングを開始することが出来ます。

source: If you want to use Dev Services then all you need to do is include the relevant extension for the type of database you want (either reactive or JDBC, or both). Don't configure a database URL, username and password - Quarkus will provide the database and you can just start coding without worrying about config.
ja_jp: DevServicesを使用する場合、必要なのは使用するデータベースの種類（リアクティブまたはJDBC、またはその両方）に応じた関連するエクステンションを含めることだけで、データベースのURLやユーザー名、パスワードを設定する必要はありません。Quarkusがデータベースを提供するので、ユーザーは設定に煩わされることなく、ただコーディングを開始することが出来ます。

source: If you want to use Dev Services then all you need to do is include the relevant extension for the type of database you want, e.g. `jdbc-postgresql`, `reactive-pg-client` or both. Don't configure a database URL, username and password - Quarkus will provide the database and you can just start coding without worrying about config.
ja_jp: DevServicesを使用する場合、必要なのは使用するデータベースの種類（リアクティブまたはJDBC、またはその両方）に応じた関連するエクステンションを含めることだけで、データベースのURLやユーザー名、パスワードを設定する必要はありません。Quarkusがデータベースを提供するので、ユーザーは設定に煩わされることなく、ただコーディングを開始することが出来ます。

source: If you want to use Docker to run a Cassandra database, you can use the following command to launch one in the background:
ja_jp: Docker を使用して Cassandra データベースを実行する場合は、次のコマンドを使用してバックグラウンドでデータベースを起動できます。

source: If you want to use Docker to run a MongoDB database, you can use the following command to launch one:
ja_jp: Dockerを使ってMongoDBデータベースを起動したい場合は、以下のコマンドで起動することができます。

source: If you want to use Docker to run an Elasticsearch instance, you can use the following command to launch one:
ja_jp: Dockerを使ってElasticsearchインスタンスを起動したい場合は、以下のコマンドで起動します:

source: If you want to use Quarkiverse to publish your extension on the Hub (which is what we recommend) and make use of all the advantages you get by using it, you simply need to open a new extension proposal issue in the quarkusio/quarkus GitHub organization. By doing this, most of the requirements are fulfilled already as there will be a template generated for you and you just have to implement your extension code. In case you are using an existing project as template, there are some requirements you need to take care of. In order to automate extension releases and publication of docs, there are some rules that need to be followed for projects under the Quarkiverse organization:
ja_jp: Quarkiverseを使用してエクステンションをハブで公開し（これは私たちが推奨する方法です）、それによって得られるすべての利点を利用したい場合は、単にquarkusio/quarkusのGitHub組織で新しいエクステンション提案の課題をオープンする必要があります。こうすることで、テンプレートが生成され、あなたはエクステンションのコードを実装するだけなので、ほとんどの要件はすでに満たされていることになります。既存のプロジェクトをテンプレートとして使用する場合は、いくつかの要件に注意する必要があります。エクステンションのリリースやドキュメントの公開を自動化するために、Quarkiverseの組織下にあるプロジェクトには従わなければならないルールがあります。

source: If you want to use Qute in your JAX-RS application, then depending on which JAX-RS stack you are using, you'll need to register the proper extension first. If you are using the traditional `quakus-resteasy` extension, then in your `pom.xml` file, add:
ja_jp: JAX-RSアプリケーションでQuteを使用したい場合、使用しているJAX-RSスタックによっては、まず適切なエクステンションを登録する必要があります。トラディショナルな `quakus-resteasy` のエクステンションを使用している場合は、 以下を `pom.xml` ファイルに追加してください。

source: If you want to use Qute in your JAX-RS application, you need to add an extension first:
ja_jp: JAX-RS アプリケーションで Qute を使用する場合は、まずエクステンションを追加する必要があります:

source: If you want to use Qute in your Jakarta REST application, then depending on which Jakarta REST stack you are using, you'll need to register the proper extension first.
ja_jp: Jakarta REST アプリケーションで Qute を使用する場合は、使用している Jakarta REST スタックに応じて適切なエクステンションを最初に登録する必要があります。

source: If you want to use Qute in your Jakarta REST application, you need to add an extension first:
ja_jp: Jakarta REST アプリケーションで Qute を使用する場合は、まずエクステンションを追加する必要があります:

source: If you want to use Qute in your Quarkus application add the following dependency to your project:
ja_jp: QuarkusアプリケーションでQuteを使用する場合は、以下の依存関係をプロジェクトに追加してください。

source: If you want to use Qute in your Quarkus application, add the following dependency to your project:
ja_jp: QuarkusアプリケーションでQuteを使用する場合は、次の依存関係をプロジェクトに追加します:

source: If you want to use RabbitMQ, you should use the xref:rabbitmq.adoc[Quarkus Messaging RabbitMQ extension]. Alternatively, if you want to use RabbitMQ with AMQP 1.0 you need to enable the AMQP 1.0 plugin in the RabbitMQ broker; check the https://smallrye.io/smallrye-reactive-messaging/smallrye-reactive-messaging/3.9/amqp/amqp.html#amqp-rabbitmq[connecting to RabbitMQ] documentation.
ja_jp: RabbitMQを使用する場合は、 xref:rabbitmq.adoc[Quarkus Messaging RabbitMQエクステンション] を使用してください。 または、RabbitMQをAMQP 1.0で使用する場合は、RabbitMQブローカでAMQP 1.0プラグインを有効にする必要があります。 https://smallrye.io/smallrye-reactive-messaging/smallrye-reactive-messaging/3.9/amqp/amqp.html#amqp-rabbitmq[RabbitMQへの接続] ドキュメントを参照してください。

source: If you want to use RabbitMQ, you should use the xref:rabbitmq.adoc[SmallRye Reactive Messaging RabbitMQ extension]. Alternatively, if want to use RabbitMQ with AMQP 1.0 you need to enable the AMQP 1.0 plugin in the RabbitMQ broker; check the https://smallrye.io/smallrye-reactive-messaging/smallrye-reactive-messaging/3.9/amqp/amqp.html#amqp-rabbitmq[connecting to RabbitMQ] documentation.
ja_jp: RabbitMQ を使用する場合は、xref:rabbitmq.adoc[SmallRye Reactive Messaging RabbitMQ extension] を使用する必要があります。または、AMQP 1.0 で RabbitMQ を使用する場合は、RabbitMQ ブローカーで AMQP 1.0 プラグインを有効にする必要があります。 https://smallrye.io/smallrye-reactive-messaging/smallrye-reactive-messaging/3.9/amqp/amqp.html#amqp-rabbitmq[connecting to RabbitMQ] のドキュメントを確認してください。

source: If you want to use RabbitMQ, you should use the xref:rabbitmq.adoc[SmallRye Reactive Messaging RabbitMQ extension]. Alternatively, if you want to use RabbitMQ with AMQP 1.0 you need to enable the AMQP 1.0 plugin in the RabbitMQ broker; check the https://smallrye.io/smallrye-reactive-messaging/smallrye-reactive-messaging/3.9/amqp/amqp.html#amqp-rabbitmq[connecting to RabbitMQ] documentation.
ja_jp: RabbitMQ を使用する場合は、 xref:rabbitmq.adoc[SmallRye Reactive Messaging RabbitMQ エクステンション] を使用する必要があります。または、AMQP 1.0 で RabbitMQ を使用する場合は、RabbitMQ ブローカーで AMQP 1.0 プラグインを有効にする必要があります。 https://smallrye.io/smallrye-reactive-messaging/smallrye-reactive-messaging/3.9/amqp/amqp.html#amqp-rabbitmq[connecting to RabbitMQ] のドキュメントを確認してください。

source: If you want to use Redis Stack _modules_ (bloom, graph, search...), set the image-name to `redis/redis-stack:latest`
ja_jp: Redis Stack _modules_ (bloom, graph, search...)を使用する場合は、image-nameに `redis/redis-stack:latest`

source: If you want to use SSL/TLS encryption, you need to add these properties in your `application.properties`:
ja_jp: SSL/TLS 暗号化を使用したい場合は、これらのプロパティを `application.properties` に追加する必要があります。

source: If you want to use SSL/TLS encryption, you need to add this property in your `application.properties`:
ja_jp: SSL/TLS暗号化を使用したい場合は、このプロパティを `application.properties` に追加する必要があります：

source: If you want to use Vert.x (or any other non-blocking framework) and keep the lazy initialization behavior, you should instead inject only a `CompletionStage` or a `Uni` of the desired bean. When injecting these beans, the initialization process will be triggered lazily, but it will happen in the background, in a non-blocking way, leveraging the Vert.x event loop. This way you don't risk blocking the Vert.x thread.
ja_jp: Vert.x（または他のノンブロッキングフレームワーク）を使用し、遅延初期化動作を維持したい場合、代わりに目的のBeanの `CompletionStage` または `Uni` のみを注入する必要があります。これらのBeanを注入すると、初期化プロセスは遅延的にトリガーされますが、Vert.xのイベントループを活用したノンブロッキングの方法でバックグラウンドで発生します。こうすることで、Vert.xのスレッドをブロックするリスクを回避することができます。

source: If you want to use Vert.x (or any other reactive framework) and keep the lazy initialization behavior, you should instead inject only `CompletionStage<QuarkusCqlSession>` or `Uni<QuarkusCqlSession>`. When injecting these beans, the initialization process will be triggered lazily, but it will happen in the background, in a non-blocking way, leveraging the Vert.x event loop. This way you don't risk blocking the Vert.x thread.
ja_jp: Vert.x (またはその他のリアクティブフレームワーク) を使用して遅延初期化の動作を維持する場合は、代わりに `CompletionStage<QuarkusCqlSession>` または `Uni<QuarkusCqlSession>` だけを挿入してください。これらの Bean を注入すると、初期化プロセスは遅延してトリガーされますが、Vert.x イベントループを利用して、ブロックされない方法でバックグラウンドで実行されます。このようにして、Vert.x スレッドをブロックするリスクを回避できます。

source: If you want to use `io.vertx.core.json.JsonObject` as data in your templates, then you will need to add the `quarkus-vertx` extension to your build file if not already part of your dependencies (most applications use this extension by default).
ja_jp: テンプレートで `io.vertx.core.json.JsonObject` をデータとして使用する場合、依存関係にまだ含まれていなければ、ビルドファイルに `quarkus-vertx` エクステンションを追加する必要があります (ほとんどのアプリケーションでは、このエクステンションがデフォルトで使用されます)。

source: If you want to use a different version than the one specified by Quarkus' BOM in your application (for example, to try pre-release features or for compatibility reasons), you can do so by using the `strictly {}` version modifier in your Gradle dependencies. For instance:
ja_jp: アプリケーションで Quarkus の BOM で指定されているものとは異なるバージョンを使用する場合 (たとえば、プレリリース機能を試すため、または互換性の理由から)、Gradle の依存関係で `strictly {}` バージョン修飾子を使用してこれを行うことができます 。 例:

source: If you want to use a specific codec, you need to explicitly set it on both ends:
ja_jp: 特定のコーデックを使用したい場合は、両側で明示的に設定する必要があります。

source: If you want to use a specific codec, you need to set it on both ends explicitly:
ja_jp: 特定のコーデックを使用したい場合は、両サイドで明示的に設定する必要があります。

source: If you want to use a specific version, you can directly target a version:
ja_jp: 特定のバージョンを使用したい場合は、直接バージョンを指定することができます。

source: If you want to use another Infinispan for your cache, configure the `client-name` as follows:
ja_jp: キャッシュに別の Infinispan を使用する場合は、 `client-name` を以下のように設定します。

source: If you want to use another Redis for your cache, configure the `client-name` as follows:
ja_jp: キャッシュに別のRedisを使用する場合は、 `client-name` を以下のように設定してください:

source: If you want to use quarkus with the dev mode, it won't be possible to manually specify the flags we mentioned along this guide. Instead, you want to specify them all in the configuration of the `quarkus-maven-plugin` as presented below.
ja_jp: Quarkusをdevモードで使用したい場合、このガイドで説明したフラグを手動で指定することはできません。 代わりに以下のように `quarkus-maven-plugin` の設定で指定します。

source: If you want to use the AWS Gateway HTTP API, generate your project with this script:
ja_jp: AWS Gateway HTTP APIを使用する場合は、このスクリプトでプロジェクトを生成します。

source: If you want to use the AWS Gateway REST API, generate your project with this script:
ja_jp: AWS Gateway REST APIを使用する場合は、このスクリプトでプロジェクトを生成します。

source: If you want to use the Confluent Schema Registry, you need the `quarkus-confluent-registry-avro` extension, instead of the `quarkus-apicurio-registry-avro` extension. Also, you need to add a few dependencies and a custom Maven repository to your `pom.xml` / `build.gradle` file:
ja_jp: Confluent Schema Registry を使用する場合、 `quarkus-apicurio-registry-avro` エクステンションの代わりに、 `quarkus-confluent-registry-avro` エクステンションと、さらにいくつかの依存関係が必要です。また、Confluent Maven リポジトリーを `pom.xml` / `build.gradle` ファイルに追加する必要があります。

source: If you want to use the Confluent Schema Registry, you need the `quarkus-confluent-registry-json-schema` extension, instead of the `quarkus-apicurio-registry-json-schema` extension. Also, you need to add a few dependencies and a custom Maven repository to your `pom.xml` / `build.gradle` file:
ja_jp: Confluent Schema Registry を使用する場合は、`quarkus-apicurio-registry-json-schema` エクステンションではなく、`quarkus-confluent-registry-json-schema` エクステンションが必要です。 また、`pom.xml` / `build.gradle` ファイルにいくつかの依存関係とカスタム Maven リポジトリーを追加する必要があります。

source: If you want to use the Elasticsearch Java client instead, replace the `quarkus-elasticsearch-rest-client` extension by the `quarkus-elasticsearch-java-client` extension.
ja_jp: Elasticsearch Java クライアントを代わりに使用する場合は、 `quarkus-elasticsearch-rest-client` エクステンションを `quarkus-elasticsearch-java-client` エクステンションに置き換えてください。

source: If you want to use the Gmail SMTP server, first create a dedicated password in `Google Account > Security > App passwords` or go to https://myaccount.google.com/apppasswords.
ja_jp: GmailのSMTPサーバーを使用する場合は、まず、 `Google Account > Security > App passwords` で専用のパスワードを作成するか、 https://myaccount.google.com/apppasswords にアクセスしてください。

source: If you want to use the Keycloak Admin Client to configure your server from your application you need to include the `quarkus-keycloak-admin-client` extension.
ja_jp: Keycloak Admin Clientを使用して、アプリケーションからサーバーを設定したい場合は、 `quarkus-keycloak-admin-client` エクステンションを含める必要があります。

source: If you want to use the Keycloak Admin Client to configure your server from your application you need to include the either `quarkus-keycloak-admin-client` or the `quarkus-keycloak-admin-client-reactive` (if the application uses `quarkus-rest-client-reactive`) extension. See the xref:security-keycloak-admin-client.adoc[Quarkus Keycloak Admin Client] guide for more information.
ja_jp: Keycloak Admin Clientを使用して、アプリケーションからサーバーを設定したい場合は、 `quarkus-keycloak-admin-client` エクステンションまたは `quarkus-keycloak-admin-client-reactive` エクステンション (アプリケーションが `quarkus-rest-client-reactive` を使用する場合) のどちらかを含める必要があります。詳しくは xref:security-keycloak-admin-client.adoc[Quarkus Keycloak Admin Client] ガイドをご覧ください。

source: If you want to use the `AuthzClient` directly, set `quarkus.keycloak.policy-enforcer.enable=true`; otherwise, no bean is available for injection.
ja_jp: `AuthzClient` を直接使用する場合は、 `quarkus.keycloak.policy-enforcer.enable=true` を設定します。設定しない場合は、注入に Bean を使用できません。

source: If you want to use the high level client instead, replace the `elasticsearch-rest-client` extension by the `elasticsearch-rest-high-level-client` extension.
ja_jp: 代わりに高レベルクライアントを使いたい場合は、 `elasticsearch-rest-client` のエクステンションを `elasticsearch-rest-high-level-client` のエクステンションで置き換えてください。

source: If you want to use the legacy API, you need to add the following dependency to your build file:
ja_jp: レガシーAPIを使用したい場合は、次の依存関係をビルドファイルに追加する必要があります。

source: If you want to use this extension, you need to add the `io.quarkus:quarkus-redis` extension first. In your `pom.xml` file, add:
ja_jp: このエクステンションを使用する場合は、最初に `io.quarkus:quarkus-redis` エクステンションを追加する必要があります。 `pom.xml` ファイルに、以下を追加します。

source: If you wish to disable a specific scheduled method, you can set its cron expression to `"off"` or `"disabled"`.
ja_jp: 特定のスケジュールメソッドを無効にしたい場合は、そのcron式を `"off"` または `"disabled"` に設定します。

source: If you wish to generate configuration section of a given `@ConfigGroup`, Quarkus has got you covered with the `@ConfigDocSection` annotation. See the code example below:
ja_jp: ある `@ConfigGroup` の設定セクションを生成したい場合は、 `@ConfigDocSection` アノテーションで対応できます。以下のコード例を参照してください。

source: If you wish to learn more about Quarkus-specific features and limitations there is a Quarkus xref:cdi-reference.adoc[CDI Reference Guide]. We also recommend you to read the https://jakarta.ee/specifications/cdi/2.0/cdi-spec-2.0.html[CDI specification] and the https://docs.jboss.org/weld/reference/latest/en-US/html/[Weld documentation] (Weld is a CDI Reference Implementation) to get acquainted with more complex topics.
ja_jp: Quarkus固有の機能や制限事項について詳しく知りたい場合は、Quarkus xref:cdi-reference.adoc[CDIリファレンスガイド]をご参照ください。また、より複雑なトピックを知るために、 link:https://jakarta.ee/specifications/cdi/2.0/cdi-spec-2.0.html[CDIの仕様]や link:https://docs.jboss.org/weld/reference/latest/en-US/html/[Weldのドキュメント]（WeldはCDIリファレンス実装）を読むことをお勧めします。
